# M3: Advanced Matplotlib Graphing Assignment
Jason Merten

In [1]:
import pandas as pd 
import matplotlib.pyplot as plt 
import numpy as np 
%matplotlib inline
from os import getcwd
print(getcwd())

c:\Users\jmert\Documents\W&M\BUAD5112\M3

In [16]:
data = pd.read_csv('ConstructionTimeSeriesDataV2.csv')
data.rename(columns={'Month-Year':'Date','Total Construction':'Total','Private Construction':'Private','Public Construction':'Public'},inplace=True)
data.Date = '1-'+data.Date
data.Date = pd.to_datetime(data.Date,dayfirst=True)
data.drop(['Month'],axis=1,inplace=True)
data.head()

        Date  Total  Private  Public
0 2002-01-01  59516    45273   14243
1 2002-02-01  58588    44475   14113
2 2002-03-01  63782    49396   14386
3 2002-04-01  69504    53283   16221
4 2002-05-01  73384    55009   18375

In [17]:
data.describe()

               Total       Private        Public
count     146.000000    146.000000    146.000000
mean    79470.671233  57372.205479  22098.561644
std     14283.534186  12879.092813   4718.077475
min     50544.000000  32069.000000  13689.000000
25%     69537.500000  46728.750000  18506.750000
50%     77923.000000  55955.500000  21513.000000
75%     88064.750000  66920.750000  25746.750000
max    110434.000000  84649.000000  31786.000000

In [63]:
data.tail()

     Month       Date  Total  Private  Public
141    142 2013-10-01  85193    59370   25823
142    143 2013-11-01  77931    55191   22741
143    144 2013-12-01  71502    52132   19369
144    145 2014-01-01  64661    47827   16834
145    146 2014-02-01  63368    46647   16721